node {
  name: "x_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "y_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377\034\000\000\000\034\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "x_input"
  input: "Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "first_layer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\001\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "first_layer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "first_layer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "first_layer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "first_layer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "first_layer/truncated_normal/mul"
  op: "Mul"
  input: "first_layer/truncated_normal/TruncatedNormal"
  input: "first_layer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "first_layer/truncated_normal"
  op: "Add"
  input: "first_layer/truncated_normal/mul"
  input: "first_layer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "first_layer/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "first_layer/weights/Assign"
  op: "Assign"
  input: "first_layer/weights"
  input: "first_layer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "first_layer/weights/read"
  op: "Identity"
  input: "first_layer/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "first_layer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "first_layer/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "first_layer/bias/Assign"
  op: "Assign"
  input: "first_layer/bias"
  input: "first_layer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "first_layer/bias/read"
  op: "Identity"
  input: "first_layer/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "first_layer/conv2d"
  op: "Conv2D"
  input: "Reshape"
  input: "first_layer/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "first_layer/add"
  op: "Add"
  input: "first_layer/conv2d"
  input: "first_layer/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "first_layer/Relu"
  op: "Relu"
  input: "first_layer/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "first_layer/pool"
  op: "MaxPool"
  input: "first_layer/Relu"
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "second_layer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "second_layer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "second_layer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "second_layer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "second_layer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "second_layer/truncated_normal/mul"
  op: "Mul"
  input: "second_layer/truncated_normal/TruncatedNormal"
  input: "second_layer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "second_layer/truncated_normal"
  op: "Add"
  input: "second_layer/truncated_normal/mul"
  input: "second_layer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "second_layer/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "second_layer/weights/Assign"
  op: "Assign"
  input: "second_layer/weights"
  input: "second_layer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "second_layer/weights/read"
  op: "Identity"
  input: "second_layer/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "second_layer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "second_layer/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "second_layer/bias/Assign"
  op: "Assign"
  input: "second_layer/bias"
  input: "second_layer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "second_layer/bias/read"
  op: "Identity"
  input: "second_layer/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "second_layer/conv2d"
  op: "Conv2D"
  input: "first_layer/pool"
  input: "second_layer/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "second_layer/add"
  op: "Add"
  input: "second_layer/conv2d"
  input: "second_layer/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "second_layer/Relu"
  op: "Relu"
  input: "second_layer/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "second_layer/pool"
  op: "MaxPool"
  input: "second_layer/Relu"
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "fc_layer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\014\000\000\000\004\000\000"
      }
    }
  }
}
node {
  name: "fc_layer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "fc_layer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "fc_layer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "fc_layer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "fc_layer/truncated_normal/mul"
  op: "Mul"
  input: "fc_layer/truncated_normal/TruncatedNormal"
  input: "fc_layer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fc_layer/truncated_normal"
  op: "Add"
  input: "fc_layer/truncated_normal/mul"
  input: "fc_layer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fc_layer/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3136
        }
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fc_layer/weights/Assign"
  op: "Assign"
  input: "fc_layer/weights"
  input: "fc_layer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fc_layer/weights/read"
  op: "Identity"
  input: "fc_layer/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fc_layer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1024
          }
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "fc_layer/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fc_layer/bias/Assign"
  op: "Assign"
  input: "fc_layer/bias"
  input: "fc_layer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fc_layer/bias/read"
  op: "Identity"
  input: "fc_layer/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fc_layer/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377@\014\000\000"
      }
    }
  }
}
node {
  name: "fc_layer/Reshape"
  op: "Reshape"
  input: "second_layer/pool"
  input: "fc_layer/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fc_layer/MatMul"
  op: "MatMul"
  input: "fc_layer/Reshape"
  input: "fc_layer/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "fc_layer/add"
  op: "Add"
  input: "fc_layer/MatMul"
  input: "fc_layer/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fc_layer/Relu"
  op: "Relu"
  input: "fc_layer/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "dropout_layer/dropout/Shape"
  op: "Shape"
  input: "fc_layer/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "dropout_layer/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "dropout_layer/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "dropout_layer/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "dropout_layer/dropout/random_uniform/sub"
  op: "Sub"
  input: "dropout_layer/dropout/random_uniform/max"
  input: "dropout_layer/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/dropout/random_uniform/mul"
  op: "Mul"
  input: "dropout_layer/dropout/random_uniform/RandomUniform"
  input: "dropout_layer/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/dropout/random_uniform"
  op: "Add"
  input: "dropout_layer/dropout/random_uniform/mul"
  input: "dropout_layer/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/dropout/add"
  op: "Add"
  input: "dropout_layer/Placeholder"
  input: "dropout_layer/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/dropout/Floor"
  op: "Floor"
  input: "dropout_layer/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/dropout/Inv"
  op: "Inv"
  input: "dropout_layer/Placeholder"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/dropout/mul"
  op: "Mul"
  input: "fc_layer/Relu"
  input: "dropout_layer/dropout/Inv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dropout_layer/dropout/mul_1"
  op: "Mul"
  input: "dropout_layer/dropout/mul"
  input: "dropout_layer/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "readout_layer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\004\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "readout_layer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "readout_layer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "readout_layer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "readout_layer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "readout_layer/truncated_normal/mul"
  op: "Mul"
  input: "readout_layer/truncated_normal/TruncatedNormal"
  input: "readout_layer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "readout_layer/truncated_normal"
  op: "Add"
  input: "readout_layer/truncated_normal/mul"
  input: "readout_layer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "readout_layer/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "readout_layer/weights/Assign"
  op: "Assign"
  input: "readout_layer/weights"
  input: "readout_layer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "readout_layer/weights/read"
  op: "Identity"
  input: "readout_layer/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "readout_layer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 10
          }
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "readout_layer/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "readout_layer/bias/Assign"
  op: "Assign"
  input: "readout_layer/bias"
  input: "readout_layer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "readout_layer/bias/read"
  op: "Identity"
  input: "readout_layer/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "softmax_layer/MatMul"
  op: "MatMul"
  input: "dropout_layer/dropout/mul_1"
  input: "readout_layer/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "softmax_layer/add"
  op: "Add"
  input: "softmax_layer/MatMul"
  input: "readout_layer/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "softmax_layer/Softmax"
  op: "Softmax"
  input: "softmax_layer/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cost_func/Log"
  op: "Log"
  input: "softmax_layer/Softmax"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cost_func/mul"
  op: "Mul"
  input: "y_input"
  input: "cost_func/Log"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cost_func/Rank"
  op: "Rank"
  input: "cost_func/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cost_func/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "cost_func/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "cost_func/range"
  op: "Range"
  input: "cost_func/range/start"
  input: "cost_func/Rank"
  input: "cost_func/range/delta"
}
node {
  name: "cost_func/Sum"
  op: "Sum"
  input: "cost_func/mul"
  input: "cost_func/range"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "cost_func/Neg"
  op: "Neg"
  input: "cost_func/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cost_func/ScalarSummary/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "cross_entropy"
      }
    }
  }
}
node {
  name: "cost_func/ScalarSummary"
  op: "ScalarSummary"
  input: "cost_func/ScalarSummary/tags"
  input: "cost_func/Neg"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/Shape"
  op: "Shape"
  input: "cost_func/Neg"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "training/gradients/Fill"
  op: "Fill"
  input: "training/gradients/Shape"
  input: "training/gradients/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/Neg_grad/Neg"
  op: "Neg"
  input: "training/gradients/Fill"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/Shape"
  op: "Shape"
  input: "cost_func/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/Rank"
  op: "Rank"
  input: "cost_func/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/Shape_1"
  op: "Shape"
  input: "cost_func/range"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/range"
  op: "Range"
  input: "training/gradients/cost_func/Sum_grad/range/start"
  input: "training/gradients/cost_func/Sum_grad/Rank"
  input: "training/gradients/cost_func/Sum_grad/range/delta"
}
node {
  name: "training/gradients/cost_func/Sum_grad/Fill/value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/Fill"
  op: "Fill"
  input: "training/gradients/cost_func/Sum_grad/Shape_1"
  input: "training/gradients/cost_func/Sum_grad/Fill/value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/DynamicStitch"
  op: "DynamicStitch"
  input: "training/gradients/cost_func/Sum_grad/range"
  input: "cost_func/range"
  input: "training/gradients/cost_func/Sum_grad/Shape"
  input: "training/gradients/cost_func/Sum_grad/Fill"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/floordiv"
  op: "Div"
  input: "training/gradients/cost_func/Sum_grad/Shape"
  input: "training/gradients/cost_func/Sum_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/Reshape"
  op: "Reshape"
  input: "training/gradients/cost_func/Neg_grad/Neg"
  input: "training/gradients/cost_func/Sum_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/Sum_grad/Tile"
  op: "Tile"
  input: "training/gradients/cost_func/Sum_grad/Reshape"
  input: "training/gradients/cost_func/Sum_grad/floordiv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/Shape"
  op: "Shape"
  input: "y_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/Shape_1"
  op: "Shape"
  input: "cost_func/Log"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "training/gradients/cost_func/mul_grad/Shape"
  input: "training/gradients/cost_func/mul_grad/Shape_1"
}
node {
  name: "training/gradients/cost_func/mul_grad/mul"
  op: "Mul"
  input: "training/gradients/cost_func/Sum_grad/Tile"
  input: "cost_func/Log"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/Sum"
  op: "Sum"
  input: "training/gradients/cost_func/mul_grad/mul"
  input: "training/gradients/cost_func/mul_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/Reshape"
  op: "Reshape"
  input: "training/gradients/cost_func/mul_grad/Sum"
  input: "training/gradients/cost_func/mul_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/mul_1"
  op: "Mul"
  input: "y_input"
  input: "training/gradients/cost_func/Sum_grad/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/Sum_1"
  op: "Sum"
  input: "training/gradients/cost_func/mul_grad/mul_1"
  input: "training/gradients/cost_func/mul_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/Reshape_1"
  op: "Reshape"
  input: "training/gradients/cost_func/mul_grad/Sum_1"
  input: "training/gradients/cost_func/mul_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/gradients/cost_func/mul_grad/Reshape"
  input: "^training/gradients/cost_func/mul_grad/Reshape_1"
}
node {
  name: "training/gradients/cost_func/mul_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/gradients/cost_func/mul_grad/Reshape"
  input: "^training/gradients/cost_func/mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/mul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/gradients/cost_func/mul_grad/Reshape_1"
  input: "^training/gradients/cost_func/mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/Log_grad/Inv"
  op: "Inv"
  input: "softmax_layer/Softmax"
  input: "^training/gradients/cost_func/mul_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/cost_func/Log_grad/mul"
  op: "Mul"
  input: "training/gradients/cost_func/mul_grad/tuple/control_dependency_1"
  input: "training/gradients/cost_func/Log_grad/Inv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/Softmax_grad/mul"
  op: "Mul"
  input: "training/gradients/cost_func/Log_grad/mul"
  input: "softmax_layer/Softmax"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/Softmax_grad/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "training/gradients/softmax_layer/Softmax_grad/Sum"
  op: "Sum"
  input: "training/gradients/softmax_layer/Softmax_grad/mul"
  input: "training/gradients/softmax_layer/Softmax_grad/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/softmax_layer/Softmax_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\001\000\000\000"
      }
    }
  }
}
node {
  name: "training/gradients/softmax_layer/Softmax_grad/Reshape"
  op: "Reshape"
  input: "training/gradients/softmax_layer/Softmax_grad/Sum"
  input: "training/gradients/softmax_layer/Softmax_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/Softmax_grad/sub"
  op: "Sub"
  input: "training/gradients/cost_func/Log_grad/mul"
  input: "training/gradients/softmax_layer/Softmax_grad/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/Softmax_grad/mul_1"
  op: "Mul"
  input: "training/gradients/softmax_layer/Softmax_grad/sub"
  input: "softmax_layer/Softmax"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/add_grad/Shape"
  op: "Shape"
  input: "softmax_layer/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/add_grad/Shape_1"
  op: "Shape"
  input: "readout_layer/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "training/gradients/softmax_layer/add_grad/Shape"
  input: "training/gradients/softmax_layer/add_grad/Shape_1"
}
node {
  name: "training/gradients/softmax_layer/add_grad/Sum"
  op: "Sum"
  input: "training/gradients/softmax_layer/Softmax_grad/mul_1"
  input: "training/gradients/softmax_layer/add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/softmax_layer/add_grad/Reshape"
  op: "Reshape"
  input: "training/gradients/softmax_layer/add_grad/Sum"
  input: "training/gradients/softmax_layer/add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/add_grad/Sum_1"
  op: "Sum"
  input: "training/gradients/softmax_layer/Softmax_grad/mul_1"
  input: "training/gradients/softmax_layer/add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/softmax_layer/add_grad/Reshape_1"
  op: "Reshape"
  input: "training/gradients/softmax_layer/add_grad/Sum_1"
  input: "training/gradients/softmax_layer/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/gradients/softmax_layer/add_grad/Reshape"
  input: "^training/gradients/softmax_layer/add_grad/Reshape_1"
}
node {
  name: "training/gradients/softmax_layer/add_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/gradients/softmax_layer/add_grad/Reshape"
  input: "^training/gradients/softmax_layer/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/gradients/softmax_layer/add_grad/Reshape_1"
  input: "^training/gradients/softmax_layer/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/MatMul_grad/MatMul"
  op: "MatMul"
  input: "training/gradients/softmax_layer/add_grad/tuple/control_dependency"
  input: "readout_layer/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: true
    }
  }
}
node {
  name: "training/gradients/softmax_layer/MatMul_grad/MatMul_1"
  op: "MatMul"
  input: "dropout_layer/dropout/mul_1"
  input: "training/gradients/softmax_layer/add_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/softmax_layer/MatMul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/gradients/softmax_layer/MatMul_grad/MatMul"
  input: "^training/gradients/softmax_layer/MatMul_grad/MatMul_1"
}
node {
  name: "training/gradients/softmax_layer/MatMul_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/gradients/softmax_layer/MatMul_grad/MatMul"
  input: "^training/gradients/softmax_layer/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/softmax_layer/MatMul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/gradients/softmax_layer/MatMul_grad/MatMul_1"
  input: "^training/gradients/softmax_layer/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/Shape"
  op: "Shape"
  input: "dropout_layer/dropout/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/Shape_1"
  op: "Shape"
  input: "dropout_layer/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/Shape"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/Shape_1"
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/mul"
  op: "Mul"
  input: "training/gradients/softmax_layer/MatMul_grad/tuple/control_dependency"
  input: "dropout_layer/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/Sum"
  op: "Sum"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/mul"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/Reshape"
  op: "Reshape"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/Sum"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/mul_1"
  op: "Mul"
  input: "dropout_layer/dropout/mul"
  input: "training/gradients/softmax_layer/MatMul_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/Sum_1"
  op: "Sum"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/mul_1"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/Reshape_1"
  op: "Reshape"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/Sum_1"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/gradients/dropout_layer/dropout/mul_1_grad/Reshape"
  input: "^training/gradients/dropout_layer/dropout/mul_1_grad/Reshape_1"
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/Reshape"
  input: "^training/gradients/dropout_layer/dropout/mul_1_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_1_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/Reshape_1"
  input: "^training/gradients/dropout_layer/dropout/mul_1_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/Shape"
  op: "Shape"
  input: "fc_layer/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/Shape_1"
  op: "Shape"
  input: "dropout_layer/dropout/Inv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "training/gradients/dropout_layer/dropout/mul_grad/Shape"
  input: "training/gradients/dropout_layer/dropout/mul_grad/Shape_1"
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/mul"
  op: "Mul"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/tuple/control_dependency"
  input: "dropout_layer/dropout/Inv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/Sum"
  op: "Sum"
  input: "training/gradients/dropout_layer/dropout/mul_grad/mul"
  input: "training/gradients/dropout_layer/dropout/mul_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/Reshape"
  op: "Reshape"
  input: "training/gradients/dropout_layer/dropout/mul_grad/Sum"
  input: "training/gradients/dropout_layer/dropout/mul_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/mul_1"
  op: "Mul"
  input: "fc_layer/Relu"
  input: "training/gradients/dropout_layer/dropout/mul_1_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/Sum_1"
  op: "Sum"
  input: "training/gradients/dropout_layer/dropout/mul_grad/mul_1"
  input: "training/gradients/dropout_layer/dropout/mul_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/Reshape_1"
  op: "Reshape"
  input: "training/gradients/dropout_layer/dropout/mul_grad/Sum_1"
  input: "training/gradients/dropout_layer/dropout/mul_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/gradients/dropout_layer/dropout/mul_grad/Reshape"
  input: "^training/gradients/dropout_layer/dropout/mul_grad/Reshape_1"
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/gradients/dropout_layer/dropout/mul_grad/Reshape"
  input: "^training/gradients/dropout_layer/dropout/mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/dropout_layer/dropout/mul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/gradients/dropout_layer/dropout/mul_grad/Reshape_1"
  input: "^training/gradients/dropout_layer/dropout/mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/fc_layer/Relu_grad/ReluGrad"
  op: "ReluGrad"
  input: "training/gradients/dropout_layer/dropout/mul_grad/tuple/control_dependency"
  input: "fc_layer/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/fc_layer/add_grad/Shape"
  op: "Shape"
  input: "fc_layer/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/fc_layer/add_grad/Shape_1"
  op: "Shape"
  input: "fc_layer/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/fc_layer/add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "training/gradients/fc_layer/add_grad/Shape"
  input: "training/gradients/fc_layer/add_grad/Shape_1"
}
node {
  name: "training/gradients/fc_layer/add_grad/Sum"
  op: "Sum"
  input: "training/gradients/fc_layer/Relu_grad/ReluGrad"
  input: "training/gradients/fc_layer/add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/fc_layer/add_grad/Reshape"
  op: "Reshape"
  input: "training/gradients/fc_layer/add_grad/Sum"
  input: "training/gradients/fc_layer/add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/fc_layer/add_grad/Sum_1"
  op: "Sum"
  input: "training/gradients/fc_layer/Relu_grad/ReluGrad"
  input: "training/gradients/fc_layer/add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/fc_layer/add_grad/Reshape_1"
  op: "Reshape"
  input: "training/gradients/fc_layer/add_grad/Sum_1"
  input: "training/gradients/fc_layer/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/fc_layer/add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/gradients/fc_layer/add_grad/Reshape"
  input: "^training/gradients/fc_layer/add_grad/Reshape_1"
}
node {
  name: "training/gradients/fc_layer/add_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/gradients/fc_layer/add_grad/Reshape"
  input: "^training/gradients/fc_layer/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/fc_layer/add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/gradients/fc_layer/add_grad/Reshape_1"
  input: "^training/gradients/fc_layer/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/gradients/fc_layer/MatMul_grad/MatMul"
  op: "MatMul"
  input: "training/gradients/fc_layer/add_grad/tuple/control_dependency"
  input: "fc_layer/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: true
    }
  }
}
node {
  name: "training/gradients/fc_layer/MatMul_grad/MatMul_1"
  op: "MatMul"
  input: "fc_layer/Reshape"
  input: "training/gradients/fc_layer/add_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "training/gradients/fc_layer/MatMul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/gradients/fc_layer/MatMul_grad/MatMul"
